START_MESSAGE = (f"Здравствуйте!\n"
                         f"Приветственное сообщение при регистрации.\n"
                         f"Нажмите кнопку <b>«Поделиться номером»</b>, чтобы продолжить")

SEND_YOUR_NAME = (f"Напишите ваше Имя\n"
                         f"Всегда приятно, когда к вам обращаются по имени")

SHARE_YOUR_PHONE = (f"Чтобы продолжить, нажмите кнопку «Поделиться номером»")

SEND_YOUR_BIRTDATE = (f"Напишите вашу Дату Рождения в формате 31.01.1999\n"
                         f"Мы будем поздравлять вас и дарить бонусы в честь вашего дня рождения")

WRONG_BIRTHDATE = (f"Введена некоректная дата, повторите попытку")