START_MESSAGE = (f"Здравствуйте!\n"
                f"Давайте познакомимся.\n"
                f"Нажмите кнопку <b>«Поделиться номером»</b>, чтобы продолжить")

SEND_YOUR_NAME = (f"Напишите ваше <b>Имя<b>\n"
                f"Всегда приятно, когда к Вам обращаются по имени")

SEND_YOUR_NAME_AGAIN = (f"Напишите Ваше Имя")

SHARE_YOUR_PHONE = (f"Чтобы продолжить, нажмите кнопку «Поделиться номером»")

SEND_YOUR_BIRTDATE = (f"Напишите вашу Дату Рождения в формате 31.01.1999\n"
                      f"Мы будем поздравлять Вас и дарить бонусы в честь Вашего дня рождения")

WRONG_BIRTHDATE = (f"Введена некоректная дата, повторите попытку")

MENU_MESSAGE = (f"Теперь у Вас есть доступ к меню через которое Вы сможете взаимодействовать с Ботом")

SALE_BUTTON = ("<b>Регулярные акции</b>\n"
                "15% в день рождения (действует на сайте и на кассах)\n"
                "10% на самовывоз (действует только на сайте)\n\n"
                "<b>Акции в точках</b>:\n\n"
                "<b>Ред сейл</b>:\n"
                "-20% на горячее с 12:00 до 16:00 (бессрочная)\n"
                "-25% на витрину с 20:00\n\n"
                "<b>Капитанская 10</b>:\n"
                "морс 1+1 за 129₽ (1-31/05)\n"
                "-25% на витрину с 20:00\n\n"
                "<b>Планета</b>:\n"
                "-25% на витрину с 21:00")

DELIVERY_BUTTON = ("Привет! Готовы сделать заказ и полакомиться чем-то вкусным?\n"
                   "Sushi Room – это больше, чем просто роллы. У нас можно найти блюда, которые понравятся каждому.\n\n"
                   "Для того, чтобы оформить заказ нажмите на кнопку ниже.")

SUCCESS_DELIVERY_BUTTON = ("Спасибо, что выбираете Sushi Room! В ближайшее время вам перезвонит оператор для уточнения заказа.")

BONUSES_BUTTON = ("Какой-то текст про бонусы")

RESTAURANTS_BUTTON = ("Находитесь недалеко от нас? Самое время оформить самовывоз и получить скидку в 10%. Запоминайте адреса:\n\n"
        "<b>- ТРЦ Планета</b> (ул. 9 мая 77)\n"
        "<b>- ТД Red SAIL</b> (ул. Алексеева д.54А)\n"
        "<b>- Островок м-н Пятерочка 2эт.</b> (ул. Капитанская д.10)\n")

CONTACTS_BUTTON = ("<b>SushiRoom</b>\n\n"
        "<b>Телефон</b>:\n"
        "+7 (391) 280-11-55\n"
        "+7 (301) 986-04-39\n"
        "<b>Сайт</b>: https://sushiroom24.ru/\n"
        "<b>Инст</b>: https://instagram.com/sushiroom24\n"
        "<b>Вк</b>: https://vk.com/sushiroom24krsk\n"
        "<b>Время работы</b>: с 10:00 до 21:00\n")

QUESTIONS_BUTTON = ("Мы всегда рады Вашим предложениям по улучшению работы!\n\n"
                    "Оставьте отзыв, чтобы мы могли полностью оценить качество нашей работы.")

BIRTHDAY_BUTTON = ("С днём рождения! Поздравляем вас с этим прекрасным праздником. "
                   "Желаем провести его в компании близких и друзей, никогда не унывать и стремиться только к высотам!\n\n"
                   "В честь этого дня дарим скидку в 15% 3 дня до и 3 дня после заветной даты.\n"
                   "Проведите время с родными, а о еде позаботимся мы. ")