START_MESSAGE = (f"Здравствуйте!\n"
                         f"Приветственное сообщение при регистрации.\n"
                         f"Нажмите кнопку <b>«Поделиться номером»</b>, чтобы продолжить")

SEND_YOUR_NAME = (f"Напишите ваше Имя\n"
                         f"Всегда приятно, когда к вам обращаются по имени")

SHARE_YOUR_PHONE = (f"Чтобы продолжить, нажмите кнопку «Поделиться номером»")

SEND_YOUR_BIRTDATE = (f"Напишите вашу Дату Рождения в формате 31.01.1999\n"
                      f"Мы будем поздравлять вас и дарить бонусы в честь вашего дня рождения")

WRONG_BIRTHDATE = (f"Введена некоректная дата, повторите попытку")

SALE_BUTTON = ("<b>Регулярные акции</b>\n"
                         "15% в день рождения (действует на сайте и на кассах)\n"
                         "10% на самовывоз (действует только на сайте)\n\n"
                         "<b>Акции в точках</b>:\n\n"
                         "<b>Ред сейл</b>:\n"
                         "-20% на горячее с 12:00 до 16:00 (бессрочная)\n"
                         "-25% на витрину с 20:00\n\n"
                         "<b>Капитанская 10</b>:\n"
                         "морс 1+1 за 129₽ (1-31/05)\n"
                         "-25% на витрину с 20:00\n\n"
                         "<b>Планета</b>:\n"
                         "-25% на витрину с 21:00")